app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO `questions` (`created_at`, `title`, `updated_at`) VALUES('2011-04-08 13:17:22', 'How long are you gonna work', '2011-04-08 13:17:22')